01. DataFrame and Series

In [2]:
import pandas as pd

menu = pd.Series(['비빔밥','김치찌개','된장찌개'])
menu

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

In [3]:
price = pd.Series([10000, 9000, 8000])
price

0    10000
1     9000
2     8000
dtype: int64

In [4]:
# Dataframe
pd.DataFrame({
    "Menu" : menu,
    "Price" : price
})

   Menu  Price
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [5]:
df = pd.DataFrame({
    "Menu": ['Buger', 'Pizza', "Corn"],
    "Price": [10000, 9000, 8000],
    "Origin": ['US','US','US']
})

df

    Menu  Price Origin
0  Buger  10000     US
1  Pizza   9000     US
2   Corn   8000     US

In [6]:
df["Menu"]

0    Buger
1    Pizza
2     Corn
Name: Menu, dtype: object

In [7]:
df[["Menu"]]

    Menu
0  Buger
1  Pizza
2   Corn

In [8]:
df[["Menu", "Price"]]

    Menu  Price
0  Buger  10000
1  Pizza   9000
2   Corn   8000

In [9]:
cols=['Menu','Price']
df[cols]

    Menu  Price
0  Buger  10000
1  Pizza   9000
2   Corn   8000

In [10]:
print("df   :", type(df))
print("df['Price'] :", type(df['Price']))
print("df[['Price']] :", type(df[['Price']]))

df   : <class 'pandas.core.frame.DataFrame'>
df['Price'] : <class 'pandas.core.series.Series'>
df[['Price']] : <class 'pandas.core.frame.DataFrame'>

02. Data Import and Export

In [11]:
df = pd.DataFrame({
    "Menu" : ["Americano", "Latte", "Mocha", "Cappuccino", "Espresso", "Milktea", "Green Tea"],
    "Price" : [4500, 5000, 5500, 5000, 4000, 5900, 5300],
    "Calories" : [10, 110, 250, 110, 20, 210, 0],
})

df

         Menu  Price  Calories
0   Americano   4500        10
1       Latte   5000       110
2       Mocha   5500       250
3  Cappuccino   5000       110
4    Espresso   4000        20
5     Milktea   5900       210
6   Green Tea   5300         0

In [12]:
df.to_csv('coffee_menu.csv')

In [13]:
temp_df = pd.read_csv('coffee_menu.csv')
temp_df.head()

   Unnamed: 0        Menu  Price  Calories
0           0   Americano   4500        10
1           1       Latte   5000       110
2           2       Mocha   5500       250
3           3  Cappuccino   5000       110
4           4    Espresso   4000        20

In [14]:
# without index column
df.to_csv("cafe.csv", index=False)
df= pd.read_csv("cafe.csv")
df.head()

         Menu  Price  Calories
0   Americano   4500        10
1       Latte   5000       110
2       Mocha   5500       250
3  Cappuccino   5000       110
4    Espresso   4000        20

In [15]:
## Advanced Topics
# index_col
# pd.read_csv('data.csv', index_col=0)

# usecols
# pd.read_csv('data.csv', usecols=['col1', 'col2'])

# parse_dates
# pd.read_csv('data.csv', parse_dates=['date_col'])

# encoding
# pd.read_csv('data.csv', encoding='utf-8')

03. EDA

In [16]:
# Important step before data preprocessing to understand the dataset
# Involves identifying missing values, outliers, patterns, and variable characteristics
# Helps observe and understand the data from multiple perspectives

In [17]:
df.head(2)

        Menu  Price  Calories
0  Americano   4500        10
1      Latte   5000       110

In [18]:
df.sample(3)

         Menu  Price  Calories
0   Americano   4500        10
4    Espresso   4000        20
3  Cappuccino   5000       110

In [19]:
df.shape

(7, 3)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Menu      7 non-null      object
 1   Price     7 non-null      int64
 2   Calories  7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [21]:
df.corr(numeric_only=True)

             Price  Calories
Price     1.000000  0.713227
Calories  0.713227  1.000000

In [22]:
df_car = pd.DataFrame({
    "car": ['Sedan', 'SUV','Sedan', 'SUV', 'SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan' ],
    "size": ['S', 'M', 'S', 'S', 'M', 'M', 'L', 'S', 'S', 'M', 'S']
})

df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [23]:
df_car.nunique()

car     2
size    3
dtype: int64

In [24]:
print(df_car['car'].unique())
print(df_car['size'].unique())

['Sedan' 'SUV']
['S' 'M' 'L']

In [25]:
# value_counts
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    7
SUV      4
Name: count, dtype: int64
size
S    6
M    4
L    1
Name: count, dtype: int64

In [26]:
df.describe()

             Price    Calories
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [27]:
df_car.describe(include="O")

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

04. Data Type Conversion

In [28]:
data = {
    "Menu": ["Americano", "Latte", "Mocha", "Cappuccino", "Espresso", "Milktea", "Green Tea"],
    "Price": [4500.0, 5000.0, 5500.0, 5000.0, 4000.0, 5900.0, 5300.0],
    "Calories": ['10','110','250','110','20','210','0']
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Menu      7 non-null      object
 1   Price     7 non-null      float64
 2   Calories  7 non-null      object
dtypes: float64(1), object(2)
memory usage: 300.0+ bytes

In [29]:
# change data type using astype
df['Price']=df['Price'].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Menu      7 non-null      object
 1   Price     7 non-null      int32
 2   Calories  7 non-null      object
dtypes: int32(1), object(2)
memory usage: 272.0+ bytes

In [30]:
df["Calories"] = df["Calories"].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Menu      7 non-null      object
 1   Price     7 non-null      int32
 2   Calories  7 non-null      float64
dtypes: float64(1), int32(1), object(1)
memory usage: 272.0+ bytes

05. Add new columns

In [31]:
df = pd.read_csv("cafe.csv")
df.head(2)

        Menu  Price  Calories
0  Americano   4500        10
1      Latte   5000       110

In [32]:
df['New'] = 0
df.head(2)

        Menu  Price  Calories  New
0  Americano   4500        10    0
1      Latte   5000       110    0

In [33]:
# Using existing column to create a new column
discount = 0.2
df['Discounted Price'] = df['Price'] * (1 - discount)
df.head(2)

        Menu  Price  Calories  New  Discounted Price
0  Americano   4500        10    0            3600.0
1      Latte   5000       110    0            4000.0

06. Deleting Data

In [34]:
# axis = 0 means row wise operation, axis = 1 means column wise operation

df = pd.read_csv("cafe.csv")
df.head(3)

        Menu  Price  Calories
0  Americano   4500        10
1      Latte   5000       110
2      Mocha   5500       250

In [35]:
# Deleting a row
df.drop(1, axis=0, inplace=True) # inplace=True means changes are applied to the original DataFrame
df.head(3)

         Menu  Price  Calories
0   Americano   4500        10
2       Mocha   5500       250
3  Cappuccino   5000       110

In [36]:
# Deleting a column
# instead on inplace, we can also use df = df.drop('column_name', axis=1)
df = df.drop("Calories", axis=1)
df.head(3)

         Menu  Price
0   Americano   4500
2       Mocha   5500
3  Cappuccino   5000

07. Indexing/Slicing with loc

In [37]:
df=pd.read_csv("cafe.csv")
df.head(3)

        Menu  Price  Calories
0  Americano   4500        10
1      Latte   5000       110
2      Mocha   5500       250

In [38]:
# loc is index number based indexing -> loc[row_index, column_index]
df.loc[0]

Menu        Americano
Price            4500
Calories           10
Name: 0, dtype: object

In [39]:
df.loc[1, "Price"]

5000

In [40]:
df.loc[:, "Price"]  # all rows, specific column

0    4500
1    5000
2    5500
3    5000
4    4000
5    5900
6    5300
Name: Price, dtype: int64

In [41]:
df.loc[2, 'Menu':"Calories"]

Menu        Mocha
Price        5500
Calories      250
Name: 2, dtype: object

In [42]:
# use slicing to select specific rows
df.loc[2, ["Menu", "Calories"]]

Menu        Mocha
Calories      250
Name: 2, dtype: object

In [43]:
df.loc[1:3, "Menu":"Price"]

         Menu  Price
1       Latte   5000
2       Mocha   5500
3  Cappuccino   5000

08. Indexing/Slicing with iloc

In [44]:
# iloc is position based indexing -> iloc[row_index, column_index]
df = pd.read_csv("cafe.csv")
df.drop(0, axis=0, inplace=True)  # drop first row for demonstration
df.head(3)

         Menu  Price  Calories
1       Latte   5000       110
2       Mocha   5500       250
3  Cappuccino   5000       110

In [45]:
df.iloc[0]

Menu        Latte
Price        5000
Calories      110
Name: 1, dtype: object

In [46]:
df.iloc[:,1]

1    5000
2    5500
3    5000
4    4000
5    5900
6    5300
Name: Price, dtype: int64

In [47]:
df.iloc[2, 0:2]

Menu     Cappuccino
Price          5000
Name: 3, dtype: object

In [48]:
df.iloc[1:3] # only one range inside [] is for rows

         Menu  Price  Calories
2       Mocha   5500       250
3  Cappuccino   5000       110

09. Add/Update Data

In [49]:
df = pd.read_csv("cafe.csv")
df.head(2)

        Menu  Price  Calories
0  Americano   4500        10
1      Latte   5000       110

In [50]:
import numpy as np # numpy is used for numerical operations, especially in deep learning and data science
df["Origin"]=np.nan  # Adding a new column with NaN values
df

         Menu  Price  Calories  Origin
0   Americano   4500        10     NaN
1       Latte   5000       110     NaN
2       Mocha   5500       250     NaN
3  Cappuccino   5000       110     NaN
4    Espresso   4000        20     NaN
5     Milktea   5900       210     NaN
6   Green Tea   5300         0     NaN

In [51]:
# Assigning values to specific rows
df.loc[0, "Origin"] = "Columbia"
df.loc[2:3, "Origin"] = "Brazil"
df.head(4)

C:\Users\문지민\AppData\Local\Temp\ipykernel_23560\811051308.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Columbia' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[0, "Origin"] = "Columbia"

         Menu  Price  Calories    Origin
0   Americano   4500        10  Columbia
1       Latte   5000       110       NaN
2       Mocha   5500       250    Brazil
3  Cappuccino   5000       110    Brazil

In [52]:
# Adding data using loc
df.loc["Season"] = ["Christmas latte", 6000, 300, "Korea"]
df.tail(3)

                   Menu  Price  Calories Origin
5               Milktea   5900       210    NaN
6             Green Tea   5300         0    NaN
Season  Christmas latte   6000       300  Korea

In [53]:
# Adding data using loc and dictionary
# by adding using list, the number of columns must match the list length
# dictionary automatically assign NaN to missing values

df.loc[7]={
    "Menu": "Strawberry Latte",
    "Price": 2000,
    "Calories": 20,
}
df.tail(3)

                    Menu  Price  Calories Origin
6              Green Tea   5300         0    NaN
Season   Christmas latte   6000       300  Korea
7       Strawberry Latte   2000        20    NaN

In [54]:
df.drop("Season", axis=0, inplace=True)  # drop the row we just added
df.to_csv("cafe2.csv", index=False)

10. Sorting

In [55]:
df=pd.read_csv("cafe2.csv")
df.head(2)

        Menu  Price  Calories    Origin
0  Americano   4500        10  Columbia
1      Latte   5000       110       NaN

In [56]:
# sort_index
df.sort_index(ascending=False)

               Menu  Price  Calories    Origin
7  Strawberry Latte   2000        20       NaN
6         Green Tea   5300         0       NaN
5           Milktea   5900       210       NaN
4          Espresso   4000        20       NaN
3        Cappuccino   5000       110    Brazil
2             Mocha   5500       250    Brazil
1             Latte   5000       110       NaN
0         Americano   4500        10  Columbia

In [57]:
# sort_values
## by="column_name"
df.sort_values(by="Menu", ascending=False)

               Menu  Price  Calories    Origin
7  Strawberry Latte   2000        20       NaN
2             Mocha   5500       250    Brazil
5           Milktea   5900       210       NaN
1             Latte   5000       110       NaN
6         Green Tea   5300         0       NaN
4          Espresso   4000        20       NaN
3        Cappuccino   5000       110    Brazil
0         Americano   4500        10  Columbia

In [58]:
# 2 or more sorting columns
df.sort_values(["Price", "Menu"], ascending=[False, True], inplace=True)
df

               Menu  Price  Calories    Origin
5           Milktea   5900       210       NaN
2             Mocha   5500       250    Brazil
6         Green Tea   5300         0       NaN
3        Cappuccino   5000       110    Brazil
1             Latte   5000       110       NaN
0         Americano   4500        10  Columbia
4          Espresso   4000        20       NaN
7  Strawberry Latte   2000        20       NaN

In [59]:
df.reset_index(drop=True)

               Menu  Price  Calories    Origin
0           Milktea   5900       210       NaN
1             Mocha   5500       250    Brazil
2         Green Tea   5300         0       NaN
3        Cappuccino   5000       110    Brazil
4             Latte   5000       110       NaN
5         Americano   4500        10  Columbia
6          Espresso   4000        20       NaN
7  Strawberry Latte   2000        20       NaN

11. Filtering

In [60]:
df=pd.read_csv("cafe2.csv")
df.head(2)

        Menu  Price  Calories    Origin
0  Americano   4500        10  Columbia
1      Latte   5000       110       NaN

In [61]:
df["Calories"]<50

0     True
1    False
2    False
3    False
4     True
5    False
6     True
7     True
Name: Calories, dtype: bool

In [62]:
cond = df["Calories"] < 50
df[cond]  # filter rows where Calories < 50

               Menu  Price  Calories    Origin
0         Americano   4500        10  Columbia
4          Espresso   4000        20       NaN
6         Green Tea   5300         0       NaN
7  Strawberry Latte   2000        20       NaN

In [63]:
cond = df["Calories"] < 50
df[~cond]

         Menu  Price  Calories  Origin
1       Latte   5000       110     NaN
2       Mocha   5500       250  Brazil
3  Cappuccino   5000       110  Brazil
5     Milktea   5900       210     NaN

In [64]:
# multiple conditions
# & is for AND, | is for OR

cond1 = df["Price"] >= 5000
cond2 = df["Calories"] > 100
df[cond1 & cond2]

         Menu  Price  Calories  Origin
1       Latte   5000       110     NaN
2       Mocha   5500       250  Brazil
3  Cappuccino   5000       110  Brazil
5     Milktea   5900       210     NaN

In [65]:
df[cond1 | cond2]

         Menu  Price  Calories  Origin
1       Latte   5000       110     NaN
2       Mocha   5500       250  Brazil
3  Cappuccino   5000       110  Brazil
5     Milktea   5900       210     NaN
6   Green Tea   5300         0     NaN

In [66]:
cond = df["Origin"] == "Brazil"
df[cond]

         Menu  Price  Calories  Origin
2       Mocha   5500       250  Brazil
3  Cappuccino   5000       110  Brazil

In [67]:
# Filtering by using isin()
df["Menu"].isin(["Latte"])

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
Name: Menu, dtype: bool

In [68]:
cond = df["Menu"].isin(["Latte"])
df[cond]

    Menu  Price  Calories Origin
1  Latte   5000       110    NaN

In [69]:
box = ["Latte", "Americano", "Mocha"]
cond = df["Menu"].isin(box)
df[cond]

        Menu  Price  Calories    Origin
0  Americano   4500        10  Columbia
1      Latte   5000       110       NaN
2      Mocha   5500       250    Brazil

12. Missing Value Handling

In [70]:
df = pd.read_csv("cafe2.csv")
df.head(2)

        Menu  Price  Calories    Origin
0  Americano   4500        10  Columbia
1      Latte   5000       110       NaN

In [71]:
# isnull() is used to check for missing values
df.isnull()

    Menu  Price  Calories  Origin
0  False  False     False   False
1  False  False     False    True
2  False  False     False   False
3  False  False     False   False
4  False  False     False    True
5  False  False     False    True
6  False  False     False    True
7  False  False     False    True

In [72]:
df.isnull().sum()

Menu        0
Price       0
Calories    0
Origin      5
dtype: int64

In [73]:
df["Origin"].fillna("Costa Rica", inplace=True)
df

C:\Users\문지민\AppData\Local\Temp\ipykernel_23560\521782311.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Origin"].fillna("Costa Rica", inplace=True)

               Menu  Price  Calories      Origin
0         Americano   4500        10    Columbia
1             Latte   5000       110  Costa Rica
2             Mocha   5500       250      Brazil
3        Cappuccino   5000       110      Brazil
4          Espresso   4000        20  Costa Rica
5           Milktea   5900       210  Costa Rica
6         Green Tea   5300         0  Costa Rica
7  Strawberry Latte   2000        20  Costa Rica

In [74]:
df.to_csv("cafe3.csv", index=False)

13. Value Replacement

In [75]:
df= pd.read_csv("cafe3.csv")
df.head(2)

        Menu  Price  Calories      Origin
0  Americano   4500        10    Columbia
1      Latte   5000       110  Costa Rica

In [76]:
df.replace("Americano", "Long Black", inplace=True)
df.replace("Green Tea", "Matcha Latte", inplace=True)
df

               Menu  Price  Calories      Origin
0        Long Black   4500        10    Columbia
1             Latte   5000       110  Costa Rica
2             Mocha   5500       250      Brazil
3        Cappuccino   5000       110      Brazil
4          Espresso   4000        20  Costa Rica
5           Milktea   5900       210  Costa Rica
6      Matcha Latte   5300         0  Costa Rica
7  Strawberry Latte   2000        20  Costa Rica

In [77]:
# Use dictionary to replace multiple values
change = {"Long Black": "Americano", "Matcha Latte": "Green Tea"}
df.replace(change, inplace=True)
df

               Menu  Price  Calories      Origin
0         Americano   4500        10    Columbia
1             Latte   5000       110  Costa Rica
2             Mocha   5500       250      Brazil
3        Cappuccino   5000       110      Brazil
4          Espresso   4000        20  Costa Rica
5           Milktea   5900       210  Costa Rica
6         Green Tea   5300         0  Costa Rica
7  Strawberry Latte   2000        20  Costa Rica

In [78]:
df.loc[6, "Origin"] = "Korea"
df.tail(3)

               Menu  Price  Calories      Origin
5           Milktea   5900       210  Costa Rica
6         Green Tea   5300         0       Korea
7  Strawberry Latte   2000        20  Costa Rica

In [79]:
df.loc[1:2, "Event Price"] = 1000
df

               Menu  Price  Calories      Origin  Event Price
0         Americano   4500        10    Columbia          NaN
1             Latte   5000       110  Costa Rica       1000.0
2             Mocha   5500       250      Brazil       1000.0
3        Cappuccino   5000       110      Brazil          NaN
4          Espresso   4000        20  Costa Rica          NaN
5           Milktea   5900       210  Costa Rica          NaN
6         Green Tea   5300         0       Korea          NaN
7  Strawberry Latte   2000        20  Costa Rica          NaN

In [80]:
df.to_csv("cafe4.csv", index=False)

14. String Operations

In [81]:
import pandas as pd
df = pd.DataFrame({
    "A": ['데이터 분석', '기본 학습서', '퇴근 후 열공'],
    "B": [10, 20, 30],
    "C": ['ab cd', 'AB CD', 'ab cd ']
})

df

         A   B       C
0   데이터 분석  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [82]:
# cannot use replace to change a substring
df['A'] = df['A'].replace('분석', '시각화')
df

         A   B       C
0   데이터 분석  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [83]:
# str.replace() can replace substrings
df['A'] = df['A'].str.replace('분석', '시각화')
df

         A   B       C
0  데이터 시각화  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [84]:
df['A'].str.split()

0     [데이터, 시각화]
1      [기본, 학습서]
2    [퇴근, 후, 열공]
Name: A, dtype: object

In [85]:
df['A'].str.split()[0] # choose a specific row

['데이터', '시각화']

In [86]:
df['D']=df['A'].str.split().str[0]
df

         A   B       C    D
0  데이터 시각화  10   ab cd  데이터
1   기본 학습서  20   AB CD   기본
2  퇴근 후 열공  30  ab cd    퇴근

In [87]:
# str.contains() checks if a substring exists in a string
df["A"].str.contains('기본')

0    False
1     True
2    False
Name: A, dtype: bool

In [88]:
df['기본포함유무']=df['A'].str.contains('기본')
df

         A   B       C    D  기본포함유무
0  데이터 시각화  10   ab cd  데이터   False
1   기본 학습서  20   AB CD   기본    True
2  퇴근 후 열공  30  ab cd    퇴근   False

In [89]:
df['length']=df['A'].str.len()
df

         A   B       C    D  기본포함유무  length
0  데이터 시각화  10   ab cd  데이터   False       7
1   기본 학습서  20   AB CD   기본    True       6
2  퇴근 후 열공  30  ab cd    퇴근   False       7

In [90]:
'AB cd' == 'ab cd' # python is case-sensitive

False

In [91]:
df['C']=df['C'].str.lower()
df

         A   B       C    D  기본포함유무  length
0  데이터 시각화  10   ab cd  데이터   False       7
1   기본 학습서  20   ab cd   기본    True       6
2  퇴근 후 열공  30  ab cd    퇴근   False       7

In [92]:
df['C']=df['C'].str.upper()
df

         A   B       C    D  기본포함유무  length
0  데이터 시각화  10   AB CD  데이터   False       7
1   기본 학습서  20   AB CD   기본    True       6
2  퇴근 후 열공  30  AB CD    퇴근   False       7

In [93]:
df['C']=="AB CD"

0     True
1     True
2    False
Name: C, dtype: bool

In [94]:
df['C']=df['C'].str.lower()
df['C']=df['C'].str.replace(" ", "")
df['C']

0    abcd
1    abcd
2    abcd
Name: C, dtype: object

In [95]:
df['C'].str[1:3]

0    bc
1    bc
2    bc
Name: C, dtype: object

In [96]:
df['C'][1:3]

1    abcd
2    abcd
Name: C, dtype: object

15. Built-in Functions

In [97]:
df = pd.read_csv("cafe4.csv")
df.head(2)

        Menu  Price  Calories      Origin  Event Price
0  Americano   4500        10    Columbia          NaN
1      Latte   5000       110  Costa Rica       1000.0

In [98]:
print(len(df))
print(df.shape[0]) # [0] is for rows, [1] is for columns

8
8

In [99]:
cond = df['Price']>5000

print(sum(cond))
print(len(df[cond]))

3
3

In [100]:
df.sum(numeric_only=True)

Price          37200.0
Calories         730.0
Event Price     2000.0
dtype: float64

In [101]:
df.T

,0,1,2,3,4,5,6,7
Menu,Americano,Latte,Mocha,Cappuccino,Espresso,Milktea,Green Tea,Strawberry Latte
Price,4500,5000,5500,5000,4000,5900,5300,2000
Calories,10,110,250,110,20,210,0,20
Origin,Columbia,Costa Rica,Brazil,Brazil,Costa Rica,Costa Rica,Korea,Costa Rica
Event Price,NaN,1000.0,1000.0,NaN,NaN,NaN,NaN,NaN

In [102]:
df.sum(axis=1, numeric_only=True)

0    4510.0
1    6110.0
2    6750.0
3    5110.0
4    4020.0
5    6110.0
6    5300.0
7    2020.0
dtype: float64

In [103]:
print(df['Price'].max())
print(df['Price'].min())
print(df['Price'].mean())
print(df['Price'].median())
print(df['Price'].sum())
print(df['Price'].std())
print(df['Price'].var())

5900
2000
4650.0
5000.0
37200
1220.070255588353
1488571.4285714286

In [104]:
print("25%:", df['Price'].quantile(0.25))
print("75%:", df['Price'].quantile(0.75))

25%: 4375.0
75%: 5350.0

In [105]:
cond = df['Price'].quantile(0.25)>df['Price']
df[cond]

               Menu  Price  Calories      Origin  Event Price
4          Espresso   4000        20  Costa Rica          NaN
7  Strawberry Latte   2000        20  Costa Rica          NaN

In [106]:
cond2 = df['Price'].quantile(0.75)<df['Price']
df[cond2]

      Menu  Price  Calories      Origin  Event Price
2    Mocha   5500       250      Brazil       1000.0
5  Milktea   5900       210  Costa Rica          NaN

In [107]:
df["Origin"].mode()[0] # mode() returns a Series

'Costa Rica'

In [108]:
# idmax() returns the index of the maximum value
df['Price'].idxmax()
df.loc[df['Price'].idxmax()]

Menu              Milktea
Price                5900
Calories              210
Origin         Costa Rica
Event Price           NaN
Name: 5, dtype: object

In [109]:
max_index = df['Price'].idxmax()
df.loc[max_index]['Menu'] # get the Menu of the maximum Price

'Milktea'

In [110]:
# nlargest() returns the top n rows with the largest values
df.nlargest(3, 'Price')

        Menu  Price  Calories      Origin  Event Price
5    Milktea   5900       210  Costa Rica          NaN
2      Mocha   5500       250      Brazil       1000.0
6  Green Tea   5300         0       Korea          NaN

16. Grouping

In [117]:
df=pd.read_csv("cafe4.csv")
df.head(2)
df.groupby("Origin").mean(numeric_only=True)

             Price  Calories  Event Price
Origin
Brazil      5250.0     180.0       1000.0
Columbia    4500.0      10.0          NaN
Costa Rica  4225.0      90.0       1000.0
Korea       5300.0       0.0          NaN

In [122]:
df.groupby(["Origin", "Calories"]).mean(numeric_only=True)

                      Price  Event Price
Origin     Calories
Brazil     110       5000.0          NaN
           250       5500.0       1000.0
Columbia   10        4500.0          NaN
Costa Rica 20        3000.0          NaN
           110       5000.0       1000.0
           210       5900.0          NaN
Korea      0         5300.0          NaN

In [125]:
df.groupby(["Origin", "Menu"]).agg(['mean', 'sum'])

                              Price       Calories      Event Price
                               mean   sum     mean  sum        mean     sum
Origin     Menu
Brazil     Cappuccino        5000.0  5000    110.0  110         NaN     0.0
           Mocha             5500.0  5500    250.0  250      1000.0  1000.0
Columbia   Americano         4500.0  4500     10.0   10         NaN     0.0
Costa Rica Espresso          4000.0  4000     20.0   20         NaN     0.0
           Latte             5000.0  5000    110.0  110      1000.0  1000.0
           Milktea           5900.0  5900    210.0  210         NaN     0.0
           Strawberry Latte  2000.0  2000     20.0   20         NaN     0.0
Korea      Green Tea         5300.0  5300      0.0    0         NaN     0.0

In [126]:
df.groupby(["Origin", "Calories"]).mean(numeric_only=True).reset_index()

       Origin  Calories   Price  Event Price
0      Brazil       110  5000.0          NaN
1      Brazil       250  5500.0       1000.0
2    Columbia        10  4500.0          NaN
3  Costa Rica        20  3000.0          NaN
4  Costa Rica       110  5000.0       1000.0
5  Costa Rica       210  5900.0          NaN
6       Korea         0  5300.0          NaN

In [128]:
# transform()
df = pd.DataFrame({
    "Fruit": ['Straberry', "Blueberry",'Straberry', "Blueberry",'Straberry', "Blueberry",'Straberry', "Blueberry",],
    "Price": [1000, None, 1500, None, 2000, 2500, None, 1800]
})

df

       Fruit   Price
0  Straberry  1000.0
1  Blueberry     NaN
2  Straberry  1500.0
3  Blueberry     NaN
4  Straberry  2000.0
5  Blueberry  2500.0
6  Straberry     NaN
7  Blueberry  1800.0

In [133]:
price = df.groupby("Fruit")["Price"].transform("mean")
price

0    1500.0
1    2150.0
2    1500.0
3    2150.0
4    1500.0
5    2150.0
6    1500.0
7    2150.0
Name: Price, dtype: float64

In [135]:
df["Price"] = df["Price"].fillna(price)
df

       Fruit   Price
0  Straberry  1000.0
1  Blueberry  2150.0
2  Straberry  1500.0
3  Blueberry  2150.0
4  Straberry  2000.0
5  Blueberry  2500.0
6  Straberry  1500.0
7  Blueberry  1800.0

In [143]:
df = pd.DataFrame({
    "Fruit": ['Straberry', "Blueberry",'Straberry', "Blueberry",'Straberry', "Blueberry",'Straberry', "Blueberry",],
    "Score": ['B', 'B', 'A', 'A', 'A', 'A', 'B', 'B'],
    "Price": [1000, None, 1500, None, 2000, 2500, None, 1800]
})
tran = df.groupby(["Fruit", "Score"])["Price"].transform("mean")
df["Price"]= df["Price"].fillna(tran)
df

       Fruit Score   Price
0  Straberry     B  1000.0
1  Blueberry     B  1800.0
2  Straberry     A  1500.0
3  Blueberry     A  2500.0
4  Straberry     A  2000.0
5  Blueberry     A  2500.0
6  Straberry     B  1000.0
7  Blueberry     B  1800.0

In [145]:
# unstack()
coffee_data = {
    "Type": ["Americano", "Americano","Americano", "Latte", "Latte","Latte" ],
    "Size" : ["S", "M", "L", "S", "M", "L"],
    "Sales": [120, 150, 200, 100, 130, 180]
  }

df=pd.DataFrame(coffee_data)
df

        Type Size  Sales
0  Americano    S    120
1  Americano    M    150
2  Americano    L    200
3      Latte    S    100
4      Latte    M    130
5      Latte    L    180

In [150]:
new = df.groupby(["Type", "Size"])["Sales"].sum()
new1 = new.unstack()
new2 = new.unstack(level=0)
print(new1)
print(new2)

Size         L    M    S
Type
Americano  200  150  120
Latte      180  130  100
Type  Americano  Latte
Size
L           200    180
M           150    130
S           120    100

In [151]:
new.unstack().unstack()

Size  Type
L     Americano    200
      Latte        180
M     Americano    150
      Latte        130
S     Americano    120
      Latte        100
dtype: int64

17. Datetime

In [164]:
import pandas as pd
data = {
    'Date1': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04'],
    'Date2': ['2023/01/05', '2023/01/06', '2023/01/07', '2023/01/08'],
    'Date3': ['01-09-2023', '01-10-2023', '01-11-2023', '01-12-2023'],
    'Date4': ['17-Feb-2023', '18-Feb-2023', '19-Feb-2023', '20-Feb-2023'],
    'Datetime' : ['17 Feb 2025 13:50:20', '18 Mar 2025 14:30:00', '19 Apr 2025 15:45:10', '20 May 2025 16:20:30']
}
df = pd.DataFrame(data)
df.to_csv("date_data.csv", index=False)

In [167]:
df['Date1'] = pd.to_datetime(df['Date1'])
df['Date2'] = pd.to_datetime(df['Date2'], format='%Y/%m/%d')
df['Date3'] = pd.to_datetime(df['Date3'], format='%d-%m-%Y')
df['Date4'] = pd.to_datetime(df['Date4'])
df['Datetime'] = pd.to_datetime(df['Datetime'], format='%d %b %Y %H:%M:%S')
df

,Date1,Date2,Date3,Date4,Datetime,year,month,day,day_name
0,2023-01-01,2023-01-05,2023-09-01,2023-02-17,2025-02-17 13:50:20,2023,1,1,6
1,2023-01-02,2023-01-06,2023-10-01,2023-02-18,2025-03-18 14:30:00,2023,1,2,0
2,2023-01-03,2023-01-07,2023-11-01,2023-02-19,2025-04-19 15:45:10,2023,1,3,1
3,2023-01-04,2023-01-08,2023-12-01,2023-02-20,2025-05-20 16:20:30,2023,1,4,2

In [166]:
df['year']=df['Date1'].dt.year
df['month']=df['Date1'].dt.month
df['day']=df['Date1'].dt.day
df['day_name']=df['Date1'].dt.dayofweek
# dayofweek: 0=Monday, 1=Tuesday, ..., 6=Sunday
df

,Date1,Date2,Date3,Date4,Datetime,year,month,day,day_name
0,2023-01-01,2023-01-05,2023-09-01,2023-02-17,2025-02-17 13:50:20,2023,1,1,6
1,2023-01-02,2023-01-06,2023-10-01,2023-02-18,2025-03-18 14:30:00,2023,1,2,0
2,2023-01-03,2023-01-07,2023-11-01,2023-02-19,2025-04-19 15:45:10,2023,1,3,1
3,2023-01-04,2023-01-08,2023-12-01,2023-02-20,2025-05-20 16:20:30,2023,1,4,2

18. Timedelta

In [170]:
df = pd.read_csv("date_data.csv", usecols=['Datetime'], parse_dates=['Datetime'])
df

             Datetime
0 2025-02-17 13:50:20
1 2025-03-18 14:30:00
2 2025-04-19 15:45:10
3 2025-05-20 16:20:30

In [173]:
day = pd.Timedelta(days=99)
df['100day']=df['Datetime'] + day
hours = pd.Timedelta(hours=5)
df['5hours']=df['Datetime'] + hours
df

             Datetime              100day              5hours
0 2025-02-17 13:50:20 2025-05-27 13:50:20 2025-02-17 18:50:20
1 2025-03-18 14:30:00 2025-06-25 14:30:00 2025-03-18 19:30:00
2 2025-04-19 15:45:10 2025-07-27 15:45:10 2025-04-19 20:45:10
3 2025-05-20 16:20:30 2025-08-27 16:20:30 2025-05-20 21:20:30

In [174]:
diff = pd.Timedelta(weeks= 3, days=10, hours=5, minutes=30)
df['diff'] = df['Datetime'] -diff
df

,Datetime,100day,5hours,diff
0,2025-02-17 13:50:20,2025-05-27 13:50:20,2025-02-17 18:50:20,2025-01-17 08:20:20
1,2025-03-18 14:30:00,2025-06-25 14:30:00,2025-03-18 19:30:00,2025-02-15 09:00:00
2,2025-04-19 15:45:10,2025-07-27 15:45:10,2025-04-19 20:45:10,2025-03-19 10:15:10
3,2025-05-20 16:20:30,2025-08-27 16:20:30,2025-05-20 21:20:30,2025-04-19 10:50:30

19. Merging Dataframe

In [176]:
appetizer = pd.DataFrame({
    "Name": ["Spring Rolls", "Garlic Bread", "Bruschetta"],
    "Price": [5000, 6000, 7000]
})

main = pd.DataFrame({
    "Name": ["Spaghetti", "Pizza", "Burger"],
    "Price": [12000, 15000, 13000]
})
print(appetizer)
print(main)

           Name  Price
0  Spring Rolls   5000
1  Garlic Bread   6000
2    Bruschetta   7000
        Name  Price
0  Spaghetti  12000
1      Pizza  15000
2     Burger  13000

In [178]:
full_menu = pd.concat([appetizer, main], ignore_index=True)
full_menu2 = pd.concat([appetizer, main], axis=1)
print(full_menu)
print(full_menu2)

           Name  Price
0  Spring Rolls   5000
1  Garlic Bread   6000
2    Bruschetta   7000
3     Spaghetti  12000
4         Pizza  15000
5        Burger  13000
           Name  Price       Name  Price
0  Spring Rolls   5000  Spaghetti  12000
1  Garlic Bread   6000      Pizza  15000
2    Bruschetta   7000     Burger  13000

In [180]:
# merge() : by using 'name' as a key we can combine two DataFrames
price = pd.DataFrame({
    "Name": ["Americano", "Latte", "Mocha"],
    "Price": [4500, 5000, 5500]
})
calories = pd.DataFrame({
    "Name": ["Americano", "Latte", "Mocha"],
    "Calories": [10, 110, 250]
})
full_menu = pd.merge(price, calories, on="Name")
print(full_menu)

        Name  Price  Calories
0  Americano   4500        10
1      Latte   5000       110
2      Mocha   5500       250

20. Pivot Table

In [184]:
# pivot table uses index, columns, and values to create a new DataFrame by using aggregation functions (aggfunc)

data = {
    "Name": ["David", "Alice", "Bob", "Kevin", "Jane", "Willam", "Emma", "Olivia"],
    "Team": ["Marketing", "Development", "Marketing", "Development", "Development", "Marketing", "Development", "Marketing"],
    "Salary": [5000, 6000, 5500, 7000, 6500, 6000, 7200, 5800]
}
df=pd.DataFrame(data)

print("Original DataFrame:")
print(df)

# Creating a pivot table to calculate the average salary by team
pt = df.pivot_table(index="Team", values="Salary", aggfunc="mean")
print("\nPivot Table:")
print(pt)

Original DataFrame:
     Name         Team  Salary
0   David    Marketing    5000
1   Alice  Development    6000
2     Bob    Marketing    5500
3   Kevin  Development    7000
4    Jane  Development    6500
5  Willam    Marketing    6000
6    Emma  Development    7200
7  Olivia    Marketing    5800

Pivot Table:
             Salary
Team
Development  6675.0
Marketing    5575.0

In [186]:
data = {
    "Team" : ["Marketing", "Development", "Marketing", "Development", "Development", "Marketing", "Development", "Marketing"],
    "Position": ["Manager", "Developer", "Executive", "Manager", "Developer", "Executive", "Developer", "Manager"],
    "Salary": [5000, 6000, 5500, 7000, 6500, 6000, 7200, 5800]
}

df = pd.DataFrame(data)

pt = df.pivot_table(index="Team", columns="Position", values="Salary", aggfunc="mean")
pt

Position       Developer  Executive  Manager
Team
Development  6566.666667        NaN   7000.0
Marketing            NaN     5750.0   5400.0

In [193]:
data= {
    "Team" : ["Marketing", "Development", "Marketing", "Development", "Development", "Marketing", "Development", "Marketing"],
    "Gender" : ["Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female"],
    "Year" : [3,5,4,6,7,4,5,6]
}

df=pd.DataFrame(data)
df

pt = df.pivot_table(index="Team", columns="Gender", values="Year")
pt

Gender       Female  Male
Team
Development     5.5   6.0
Marketing       5.0   3.5

In [196]:
# set of practice questions
data = {
    "Type": ["Electronics","Electronics","Electronics","Electronics","Electronics", "Furniture","Furniture","Furniture","Furniture"],
    "Item": ["Normal","Normal","Normal", "Special","Special","Normal","Normal","Special","Special"],
    "Size": ["Small", "Large", "Large", "Small","Small","Large", "Small","Small", "Large"],
    "Number": [1,2,2,3,3,4,5,6,7],
    "Price": [2,4,5,5,6,6,8,9,9]
}
df = pd.DataFrame(data)
print(df)

          Type     Item   Size  Number  Price
0  Electronics   Normal  Small       1      2
1  Electronics   Normal  Large       2      4
2  Electronics   Normal  Large       2      5
3  Electronics  Special  Small       3      5
4  Electronics  Special  Small       3      6
5    Furniture   Normal  Large       4      6
6    Furniture   Normal  Small       5      8
7    Furniture  Special  Small       6      9
8    Furniture  Special  Large       7      9

In [200]:
pt = df.pivot_table(
    index=["Type", "Item"], 
    columns="Size",
    values="Number",
    aggfunc="mean",
    fill_value=0
)
pt

Size                 Large  Small
Type        Item
Electronics Normal     2.0    1.0
            Special    0.0    3.0
Furniture   Normal     4.0    5.0
            Special    7.0    6.0

In [203]:
pt = df.pivot_table(
    index=["Type", "Size"], 
    values=["Number","Price"],
    aggfunc={"Number":"mean", "Price": "mean"},
)
pt

                     Number     Price
Type        Size
Electronics Large  2.000000  4.500000
            Small  2.333333  4.333333
Furniture   Large  5.500000  7.500000
            Small  5.500000  8.500000